//ZBNKLIST JOB 'ZBNKLIST',CLASS=A,MSGCLASS=A
//*
//* GENERATE OUT OF BOUND EXCEPTION
//* 
//BANKDO   EXEC PGM=ZBNKPRT2
//REPT10   DD SYSOUT=*
//BANK10   DD DSN=EBC.BANK11,DISP=OLD
//SYSOUT   DD SYSOUT=A


